/*
Сделать запрос для получения атрибутов из указанных таблиц, применив фильтры по указанным условиям:
Таблицы: Н_ЛЮДИ, Н_ОБУЧЕНИЯ, Н_УЧЕНИКИ.
Вывести атрибуты: Н_ЛЮДИ.ИМЯ, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ГРУППА.
Фильтры: (AND)
a) Н_ЛЮДИ.ИМЯ < Ярослав.
b) Н_ОБУЧЕНИЯ.ЧЛВК_ИД < 113409.
c) Н_УЧЕНИКИ.ГРУППА < 1101.
Вид соединения: INNER JOIN.
*/

SELECT Н_ЛЮДИ.ИМЯ, Н_ОБУЧЕНИЯ.НЗК, Н_УЧЕНИКИ.ГРУППА
FROM Н_ЛЮДИ
    INNER JOIN Н_ОБУЧЕНИЯ ON Н_ЛЮДИ.ИД = Н_ОБУЧЕНИЯ.ЧЛВК_ИД
    INNER JOIN Н_УЧЕНИКИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ЧЛВК_ИД 
        AND Н_УЧЕНИКИ.ВИД_ОБУЧ_ИД = Н_ОБУЧЕНИЯ.ВИД_ОБУЧ_ИД
WHERE Н_ЛЮДИ.ИМЯ < 'Ярослав' AND Н_ОБУЧЕНИЯ.ЧЛВК_ИД < 113409 AND Н_УЧЕНИКИ.ГРУППА < 1101;