/*
Выдать различные фамилии преподавателей и число людей с каждой из этих фамилий, ограничив список фамилиями, встречающимися более 10 раз на на очной форме обучения.
Для реализации использовать подзапрос.
*/

SELECT Н_ЛЮДИ.ФАМИЛИЯ, COUNT(*) AS ЧИСЛО_ЛЮДЕЙ
FROM Н_ЛЮДИ
WHERE Н_ЛЮДИ.ИД IN (
    SELECT Н_СЕССИЯ.ЧЛВК_ИД
    FROM Н_СЕССИЯ
    INNER JOIN Н_ГРУППЫ_ПЛАНОВ
        ON Н_ГРУППЫ_ПЛАНОВ.ГРУППА = Н_СЕССИЯ.ГРУППА
    INNER JOIN Н_ПЛАНЫ
        ON Н_ПЛАНЫ.ИД = Н_ГРУППЫ_ПЛАНОВ.ПЛАН_ИД
    INNER JOIN Н_ФОРМЫ_ОБУЧЕНИЯ
        ON Н_ФОРМЫ_ОБУЧЕНИЯ.ИД = Н_ПЛАНЫ.ФО_ИД
    WHERE Н_ФОРМЫ_ОБУЧЕНИЯ.НАИМЕНОВАНИЕ = 'Очная'
)
GROUP BY Н_ЛЮДИ.ФАМИЛИЯ
HAVING COUNT(*) > 10;