/*
Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка), у которых средняя оценка не больше средней оценк(е|и) в группе 3100.
*/

SELECT л.ИД AS "Номер",
    CONCAT_WS(' ', л.ФАМИЛИЯ, л.ИМЯ, л.ОТЧЕСТВО) AS "ФИО",
    AVG(в.ОЦЕНКА::numeric) AS "Ср_оценка"
FROM Н_ЛЮДИ AS л
INNER JOIN Н_ВЕДОМОСТИ AS в ON в.ЧЛВК_ИД = л.ИД
WHERE в.ОЦЕНКА IN ('2', '3', '4', '5')
  AND EXISTS (
    SELECT 1
    FROM Н_УЧЕНИКИ AS у
    WHERE у.ЧЛВК_ИД = л.ИД
        AND у.ГРУППА = '4100'
  )
GROUP BY л.ИД, л.ФАМИЛИЯ, л.ИМЯ, л.ОТЧЕСТВО
HAVING AVG(в.ОЦЕНКА::numeric) <= (
    SELECT AVG(в3100.ОЦЕНКА::numeric)
    FROM Н_ВЕДОМОСТИ AS в3100
    WHERE в3100.ОЦЕНКА IN ('2', '3', '4', '5')
        AND EXISTS (
            SELECT 1
            FROM Н_УЧЕНИКИ AS у3100
            WHERE у3100.ЧЛВК_ИД = в3100.ЧЛВК_ИД
                AND у3100.ГРУППА = '3100'
        )
)
ORDER BY л.ИД;