/*
Получить список студентов, зачисленных до первого сентября 2012 года на первый курс очной формы обучения (специальность: Программная инженерия). В результат включить:
номер группы;
номер, фамилию, имя и отчество студента;
номер и состояние пункта приказа;
Для реализации использовать подзапрос с IN.
*/


SELECT у.ГРУППА AS "Номер группы",
    л.ИД AS "Номер студента",
    л.ФАМИЛИЯ,
    л.ИМЯ,
    л.ОТЧЕСТВО,
    у.П_ПРКОК_ИД AS "Идентификатор пункта приказа",
    у.СОСТОЯНИЕ
FROM Н_УЧЕНИКИ AS у
INNER JOIN Н_ЛЮДИ AS л ON л.ИД = у.ЧЛВК_ИД
WHERE у.НАЧАЛО < DATE '2012-09-01'
    AND у.ПЛАН_ИД IN (
        SELECT п.ИД
        FROM Н_ПЛАНЫ AS п
        INNER JOIN Н_ФОРМЫ_ОБУЧЕНИЯ AS ф
            ON ф.ИД = п.ФО_ИД
        INNER JOIN Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ AS нс
            ON нс.ИД = п.НАПС_ИД
        INNER JOIN Н_НАПР_СПЕЦ AS н
            ON н.ИД = нс.НС_ИД
        WHERE п.КУРС = 1
            AND ф.НАИМЕНОВАНИЕ = 'Очная'
            AND н.НАИМЕНОВАНИЕ = 'Программная инженерия'
    )
ORDER BY у.ГРУППА, л.ФАМИЛИЯ, л.ИМЯ;